Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] King of the East.tmx
Source language: ko_kr
Languages: en

source: 깜찍한 멍멍이가 되어도 총명한 이 동방삭님!
en: I’m still so smart even after turning into a cute dog.

source: 무팽 아저씨!
en: mupeng!

source: 만약 이길 수 없는걸 알면서도 싸워야 한다면 어쩔 텐가?
en: what would you do if you had no choice but to fight, knowing that you wouldn’t be able to win?

source: 엄마가…
en: my mom is...

source: 비키란 말야!!
en: damn demons!

source: 놈들이 좋아하는 먹잇감을 구했으니까.
en: we found a perfect bait they can’t resist.

source: 얼른 와!
en: hurry up!

source: 내 손을 잡아라…!
en: grab my hand...!

source: 여척?
en: yeochuk?

source: 너 소소니?
en: are you sosoh?

source: 봉인!!
en: seal!

source: 마을에 이방인을 들이기 쉽지 않았을 텐데…
en: it must’ve been hard to allow foreigners into your village...

source: 너희 가족을 받아줄 마을이 여기 외에 있을 것 같냐며 조용히 지내라고…
en: “since there aren’t any other villages to take you in, just work here silently.

source: 여척!
en: yeochuk!

source: 끝까지 입만 살았군.
en: he’s all talk.

source: 무섭기도 하지만…
en: but...

source: 푸하하하!
en: hahaha!

source: 아니 이 여자가!
en: what?!

source: 들으면 어쩌려고!
en: what if she hears you?!

source: 설마 정말로…?
en: is this really happening...?

source: 네가 마을을 구해야 할 이유 따윈 없잖니?
en: you don’t have any reason to save this village.

source: 숨어있는 놈들 통째로 몽땅 불태워주마!!
en: I’ll just burn everything down over there!

source: 이것들이…
en: you...

source: 아까 그 계집은 뭐람?
en: ...who was that girl?

source: 큭!
en: ugh!

source: 덩치는 산만한게 왜 그러구사냐?!
en: why are you such a loser?!

source: 이단이 / 그림 :
en: lee dani / art by

source: 품삯은 더 챙겨줄 테니까.
en: I’ll even give you a bonus.

source: 아무래도 요괴가 더 있는 모양이다.
en: I think there are more demons left.

source: 내가 줄 수 있는 네 얼굴이라고.
en: this is the face I can give you.

source: 그러니까 엄마…
en: so...

source: 헉?!
en: huh?!

source: 아니… 그…
en: no... it’s just that...

source: 물에 손대면 안돼!
en: you shouldn’t touch that water!

source: 게다가 내가 부상자란 말이지~ 도와줘~!
en: plus, I’m injured, so please help me!

source: 날 이렇게까지 몰아넣다니…
en: I can’t believe you made me do this...

source: 긴말하지 않으마.
en: I’ll cut to the chase.

source: 아줌마!!
en: hey!!

source: 이거 아주 요괴보다 못된 놈이다.
en: this guy’s worse than the demons.

source: 까, 깜짝이야.
en: y-you scared me.

source: 신지우
en: jiu shin

source: 아…
en: f...

source: 나를 방해하는 자는
en: ...if they get in my way...

source: 소란스러운… 일은 곤란해.
en: making a scene... won’t do us any good.

source: 누가 들으면 내가 차가운척하지만 사실은 마음이 따뜻한 남잔줄 알거 아냐?!
en: people might think that I have a warm heart or something if they heard that!

source: 내 천리화는 체력에 한계가 있다고 분명 말했을텐데…
en: I told you that my stamina is limited even with my sky boots on...

source: 엄마 왔다~
en: mommy’s home!

source: 깜찍해!
en: adorable!

source: 그래서 무슨 기분이어야 할지 잘 모르겠어요.
en: so I’m not sure how I should feel.

source: 이전 모습보다 더 아름답게, 아무도 몰라볼 정도로 말야.
en: I’ll make you prettier than you were before. nobody will even recognize you.

source: 어, 어머머!
en: o-oh my!

source: 크게 이상한 점도 없는 것 같고…
en: everything seems okay...

source: 그 불은 네가 낸 것이 되었지.
en: ...people spread rumors that you were the one who started the fire.

source: 아까처럼 아이가 눈 앞에서 산 채로 놈들에게 뜯어먹히면…
en: I guess when you see the kid being eaten alive in front of you...

source: 위다!!
en: look up!

source: 남자들은 사람의 몸에 개의 머리를 가진 자들이 사는 곳이지,
en: the men have human bodies with dog heads.

source: 아이구야~ 잘났다, 잘났어.
en: good for you.

source: 대체 무슨 생각인 거야?!
en: what were you thinking?!

source: 우리 아홉 명이 덤벼도 못 이겼으니까… 그래서 안 알려주는 거잖아.
en: all nine of us couldn’t defeat him... that’s why you’re not telling me.

source: 자!
en: now!

source: 어떻게…
en: how did you...

source: 요즘 여기저기 나타나서 사람들을 잡아먹는다잖니?
en: didn’t you know? demons have come out to eat people these days.

source: 요괴가 관련되어 있다면 사태를 진정시키는 것이 우선이다!
en: if demons are involved in this, then we first need to make sure the situation doesn’t get worse!

source: 버텨줘라, 체력아…!!
en: to draw all of them out...!

source: 그 후로 어째선지…
en: ...after that...

source: 그 실눈덩치, 요괴를 풀어놓고는 지는 내뺀거야?
en: that big guy just ran away after unleashing the demon.

source: 꺄악!!
en: kya!!!

source: 알겠다구!!
en: look!

source: 능력껏…
en: ...try to...

source: 저주가 풀린 게 기쁜 일인 건지, 슬픈 일인 건지…
en: I don’t know if I’m happy or sad that the curse has been lifted.

source: 모두 요괴의 먹잇감이나 돼버려라!!
en: kill them all!

source: 그나저나 이건 개가 되어도 안 벗겨졌구만…
en: these didn’t come off even when I turned into a dog...

source: 잡아먹었어요.
en: all the kids.

source: …엥?
en: huh?

source: 낫지 못해.
en: she wasn’t going to recover.

source: 그러니 너도 협조해서 돌잡이 일을 완수…
en: so you need to cooperate to carry out the mission--

source: 마을이 저주받았어.
en: this village is cursed.

source: 여척…?!
en: yeochuk...?!

source: 우와아아아!!
en: aaahhhh!

source: 이제 잘 거예요…!
en: I’m going to sleep now...!

source: 이것 좀 보세요!
en: look there!

source: 그… 금방!
en: I-I’m sorry!

source: 너 이놈~ 우릴 개로 만들었겠다?!
en: you turned us into dogs?!

source: 아니…
en: no...

source: 얼마 안 되었군.
en: ...since they passed by.

source: 부끄럼은 많아 가지고!
en: don’t be embarrassed!

source: 내가 개가 됐…!!
en: I turned into a dog...!!

source: …요.
en: ...you know?

source: 소냐?
en: are you a cow?

source: 좋아.
en: all right.

source: 너…
en: you...

source: 네가 그러고도 사람이냐?!
en: and you call yourself a human being?!

source: 몰라.
en: I don’t know.

source: 어디에 한눈을 파는 것이냐?
en: what are you looking at?

source: 뭐야, 설마…
en: no...! no way...

source: 예 따위의 인간나부랭이 아니겠어?
en: is just that lowly human, yae.

source: 밤중에 요괴의 습격을 받았어요.
en: ...were attacked by a demon at night.

source: 잘못했어요!
en: I’m sorry, I was wrong!

source: 혹시 역귀는 아닐까, 쟤?!
en: could she be a witch?!

source: 죽다 살았다…
en: I thought I was gonna die...

source: …희화를 곤란하게 만들지마.
en: don’t put the solar goddess in a difficult situation.

source: 나도 예뻐지고 싶…
en: I want to be pretty too...

source: 약속을 지키는 게 좋을 거야.
en: ...you better keep your promise.

source: …헉?!
en: ack!

source: 저리 꺼져!{j}이 자식들아!!
en: move,{j}you bastards!!

source: 이레후에 오신다면 드릴 수 있습니다.
en: I can get it to you in one week.

source: 인간들을 위해 하늘에 제를 올린 대무당이 있었다.
en: there was a great shaman who performed a ritual for the humans.

source: 아버지, 저예요!
en: ...father, it’s me!

source: 뭔가 있다고!!
en: there’s something there!

source: 제 무덤을 파는군.
en: you’re digging your own grave.

source: 저, 저희 마을이요?
en: m-my village?

source: 귀인을 만나리라…
en: ...I’ll meet a precious person.

source: 내가 어딘가 불편하게 했느냐?
en: did I make you uncomfortable?

source: 바로… 떠난다고 하더군.
en: he... said he’d leave immediately.

source: 저희 마을도… 저주가 풀리겠죠…
en: the curse will... probably be lifted from the village...

source: 소소 덕분에 여기 올 수 있었어.
en: I was able to come here thanks to sosoh.

source: 자다 말고 무슨 일인데 그래?
en: what’s going on?

source: …예, 예쁘다.
en: sh-she’s so pretty.

source: 차라리 이대로 쭈욱 개로…
en: I think you should stay as a dog...

source: 중독된 녀석이 어떻게…
en: how can someone who’s been poisoned...

source: 간밤에 산을 넘다 일행들과 변을 당한 바람에…
en: we were attacked during the night while trying to get over the mountain...

source: 그 후에 너와 너희를 이런 꼴로 만든 모두에게 본때를 보여주는 거야.
en: after that, you can crush him.

source: 여제님!!
en: miss yeoje!

source: 이 마을 사람들은 천벌을 받아도 싸다고 생각했어요.
en: I thought the people in this village deserved to be punished.

source: 염치불구하나 부디…
en: although I must act shameless, please--

source: 무슨 요술로 조화를 부린지 모르겠지만,
en: I don’t know what kind of spell you put on us,

source: 결국 네 엄마는 어떻게 되었더라~?
en: how did your mother end up?

source: 요양 차, 온천으로 유명한 이 마을에 왔었지.
en: ...to cure your mother’s illness.

source: 이 악마!
en: you’re evil!

source: …조건?
en: ...a condition?

source: 괜찮나?!
en: are you all right?!

source: 뭐 아무튼…
en: anyway...

source: 여제님 괴롭히지 마시고 얼른 돌아가시지요!!
en: stop harassing miss yeoje, and return home!

source: 희화가… 부른다…
en: the solar goddess... wants to see you...

source: 글 :
en: story by

source: 제 9 수
en: episode 9

source: 큭!!
en: ugh!

source: 그 기원이 하늘에 닿을까 두려웠는지,
en: in fear of the prayer reaching the heavens...

source: 대신 사과하마.
en: I’d like to apologize on his behalf.

source: 제 동생을 원래대로 돌려주세요!!
en: please help my brother return to the way he was!

source: 혀, 형아…
en: b-brother...

source: 모조리 없애버린다.
en: ...I will eliminate them.

source: 계속 그렇게 있어라!
en: stay still just like that!

source: 야 이~ 새끼들아!{j}먹으려면 나같이 큰놈을 먹을 것이지!!
en: bastards!{j}if you’re gonna eat people, you should eat big ones like me!

source: …뭐
en: oh yeah...

source: 엥?
en: huh?!

source: 정신지배를 받지 않다니…
en: oh? the mind control didn’t work on you...

source: 돌아와!!
en: come back!

source: 어떻게 된 거지?
en: what happened?

source: 그 상처는…
en: is that wound...

source: 자, 한번 봐봐.
en: take a look.

source: 무슨 목적으로 이런 짓을 꾸민 거야?
en: why did you do this?

source: 잘 못 짚은 건가.
en: maybe I was wrong?

source: 어어, 한발…
en: what, hanbal?

source: 뜨아악!
en: whoa!

source: 형아.
en: really?

source: 삭!
en: sak!

source: 그러니 기껏 한다는 짓이 쥐새끼처럼 숨어들어서는…
en: that’s why you had to sneak up on us...

source: 뭐가 어떻게 돌아가는지 우리도 알아야 할 거 아냐!!
en: we should also be informed of what’s going on!

source: 그러고보니 윗마을에서도 뭔가 이상한 일이 일어난 모양이던데…
en: I even heard that something happened in the upper village...

source: 방금 달빛에 뭔가가…
en: something shined just now...

source: 정 알고 싶다면 입만 나불대지 말고…
en: if you really want to know, don’t just ask me...

source: 크윽…!
en: argh...!

source: 일어서긴 커녕 손가락하나 까딱 못해야 하는데…!
en: she shouldn’t even be able to move her fingers...!

source: 죽이기만 했을 뿐 먹은 흔적은 없다.
en: demons killed these people, but it doesn’t look like they tried to eat them.

source: 어때~?
en: what do you think?

source: 더 이상 마을에 전염병 환자를 둘 수가 없어!
en: we can’t have people getting sick again!

source: 전부 행동불능 상태니까요.
en: all the others are neutralized.

source: 볼래?
en: wanna see?

source: 제 20 수
en: episode 20

source: 제 26 수
en: episode 26

source: 뭐…
en: what...?

source: 뭐?
en: what?

source: 그쪽도 덤벼볼텐가?
en: do you want to fight too?

source: 순서를 바꿔야겠는걸…
en: then I’ll need to change the order of things to do...

source: 너랑 같이 오는 걸 봤구만 네 개가 아니야?
en: I saw you guys coming together! and you’re telling me that’s not your dog?!

source: 희화가 부르는데 뭐 어쩌라구?
en: so what if the solar goddess is calling for me?

source: 오호호호호홍!
en: ahahahaha!

source: 안녕히 주무세요, 무팽 아저씨!
en: good night, mupeng!

source: 위…!
en: up there...!

source: 평범한 손님이라기엔…
en: she didn’t look like an ordinary guest...

source: 이 한 마리를 마지막으로,
en: this is the last one.

source: 지금 무슨 얘길…
en: what are you talking about...?

source: 오호라…
en: oh...

source: 아저씨…!
en: mister...!

source: 놈들이 아니라 너부터 처리할 거다.
en: ...I will get rid of you first.

source: 이 꼴이 난 후에야 기어 나오다니… 매정하잖아.
en: you’re pretty cruel to come out only after seeing the results.

source: 서둘러 쫓으면 돼.
en: let’s hurry and get to her.

source: 이 계집… 정체가 뭐지?
en: just who is... this girl?

source: 크아악!!
en: arghh!!

source: 넌 정말 멍청한 계집이야.
en: you’re such a stupid girl.

source: 둘이 아는 사이…
en: you two know each oth-?

source: 바람을 피할 만한 곳으로…
en: I should find somewhere to warm up.

source: 무슨 일이 있었던 거야?!
en: what happened here?!

source: 인간놈 주제에 감히 날 내려다 봐?
en: a mere human dares to look down on me?

source: 사방에 깔린 육괴조각이 되고 싶나?
en: ...also want to be torn to pieces?

source: 어디…
en: why don’t you...

source: 그건 뭐지?
en: what’s that?

source: 하~
en: phew...

source: 양오는?
en: what about sun?

source: 난 너희처럼 강하지도 않고,
en: I’m not as strong as you guys,

source: 그게…
en: ummm...

source: 아니면 계속해 볼테냐?
en: or do you want to continue?

source: 어, 얼굴도 예쁘신데 마음씨도 고우시네요…
en: y-you’re so pretty and nice...

source: 그래도 아직 이렇게 어린앤데 너무 가엾지 않습니까?
en: but he’s just a little kid. isn’t there anything you can do?

source: 네놈에게 넘겨진 건 진짜 거울이 아니올시다~!
en: the mirror you have isn’t the real one!

source: 눈에 상당히 거슬린단 말이지.
en: I can’t stand it.

source: 그리고…
en: and...

source: 알았구나.
en: all right.

source: 그걸…
en: how...

source: 나는?
en: what about me?

source: 내 직접 여제님께 물어…
en: I’ll ask miss yeoje myself...

source: 네 어미는 가망이 없다.
en: your mother had no hope.

source: 새로운 자리를 잡아 진경을 수호하는 임무를 이어간다는 것이 제가 본 미래였죠.
en: they continued to carry out the mission to protect the jinkyung in a new place.

source: 이게 앞으로의 세상이 될게다.
en: this is how the world is going to be going forward.

source: 항아!
en: hang-ah!

source: 맞다… 그 주책바가지 늙은이를… 구해야했지… 참…
en: oh yeah... I just remembered... I need to save that old bastard...

source: 모든 것이 갖추어지면…
en: but when things settle down...

source: 그래.
en: yes.

source: 그런데?
en: so?

source: 아버지랑 상의는 해봐야겠지만…
en: although I need to ask my father...

source: 그런 거 아니야!
en: th-that’s not it!

source: 어디 있는 거냐…?
en: where are you...?

source: 미안하지만 거절하네!
en: I’m sorry, but I must refuse!

source: 내가 화나면 얼마나 무서운지 알아!!
en: I can get really scary when I get mad, you know!

source: 삐이익!
en: squeak!

source: 엿보려던 건 아니었지만,
en: I accidentally got to see...

source: 누가 좀 도와줘요?
en: please help me!

source: 제 28 수
en: episode 28

source: 요괴의 본 모습을 드러냈군.
en: you’ve shown your true self finally.

source: 얘들아, 이제 괜찮아!
en: guys, we’re okay now!

source: 그 정돈 점치면 금방…
en: I’ll read your fortune and...

source: 요괴토벌과 봉인 임무를 맡았습니다.
en: ...I’ve received a mission to kill and seal all the demons.

source: 과거의 신들과 악귀가 깨어나,
en: past evil spirit will rise...

source: 조금 더 시간을 끌었으면 좋았을 텐데…
en: I wish I could’ve bought more time...

source: 제 32 수
en: episode 32

source: 마을 남자들이 전부 개가 되었잖아!!
en: all the men have turned into dogs!

source: 좋아, 그럼…
en: well then...

source: 네 놈…
en: you...

source: 꾸물거리지 말고 얼른~!
en: stop wasting time!

source: 용감하네.
en: how brave.

source: 거절하지 말아 달라고?
en: don’t refuse?

source: 형아아…
en: brother...

source: 네가 이곳 버러지들의 여왕벌인가?
en: are you the queen bee of these insects?

source: …뭣!
en: what?!

source: 인간도 요괴도 아니면 대체 뭔데?
en: what exactly is it, if it’s not a human or a demon?

source: 뭘 할 셈이냐고?
en: you’re wondering what I’m doing, huh?

source: 윗마을이면…
en: the upper village as in...

source: 엄청나다.
en: amazing.

source: 네놈도 저 인간계집도…
en: you and that human girl both...

source: 뻔히 보이는 도발을…
en: I knew it...

source: 뭐,
en: well...

source: 왠지…
en: for some reason...

source: 뭐야?
en: wh-what’s that?

source: 너무 똑땅해…
en: it’s all my fault...

source: 아아아앗, 그래 너야 너!!
en: agh, it’s you!!

source: 아, 네.
en: ah, yes.

source: 그렇겠죠…
en: yeah...

source: 우리 마을로 가져간다면…
en: ...and bring it back to our village...

source: 기껏 다시 살아났는데 여전히 믿음을 못 드려서…
en: you brought me back to life but I still can’t earn your trust...

source: 이리 내놓지 못해?!
en: give it back to me right now!

source: 아, 데려다줘~ 데려다줘어~!!
en: please take me there! pretty please!!

source: 자, 가져오라는 거울도 챙겼겠다…
en: now that I have the mirror...

source: 평범한 마을 애들이 아닌가?
en: but aren’t they just like any other kids from the village?

source: 으아아!!
en: ahhhhh!

source: 결국…
en: finally...

source: 니 개부터 어떻게 좀 해줄래?
en: can you do something about your dog?

source: 어, 그건 제 개가 아니라…
en: oh, that’s not my dog--

source: 그 끝에
en: ...in the end...

source: 모두 도망쳐요!!
en: run, everybody!

source: 이건 우리 마을의 일이고…
en: this is a matter of our village...

source: 다행이다.{j}아직 숨은 붙어있어…!
en: thank god.{j}he’s still alive...!

source: 만지지 마!
en: don’t touch me!

source: 지금…
en: did he...

source: …부탁이다.
en: I beg you.

source: 자기들이 불을 냈단걸 말하진 않았냐고.
en: they wondered if you were telling people that they were the ones who started the fire.

source: 예언…?
en: a prophecy...?

source: 삼천갑자쯤 살면 개로 막 변신하고 그런 줄 알았지.
en: with how long you've been living, I thought you could turn into a dog at will.

source: 제 일행인 사람들은…
en: the people who were with me...

source: 이놈이!!
en: you!!

source: 갑자기 왜 이러는 거야?!
en: what’s happening all of a sudden?!

source: …칫.
en: tch.

source: 다 죽어가던 놈이 어떻게…!!
en: how could you...?

source: 으아아악!!
en: aaahh!!

source: 네 놈도…
en: do you...

source: 엄마가 아직 안에…
en: my mom... is still in there...

source: 안다고 해도 이미 대부분 까먹었을 시간이라고.
en: too much time has passed to remember the details.

source: 부적 장난질은 통하지 않는다 했을 텐데!
en: I told you, your talisman tricks don’t work on me!

source: 네가 왜 희화를 돕는지…
en: although I’m curious to know...

source: 제 12 수
en: episode 12

source: 놈들을 유인해낼 만큼만…
en: give me enough strength...

source: 삭…
en: sak...

source: 그 여관이 있는 마을에 돌아가 보자!
en: let’s head back to the village where the inn was!

source: 고맙다고 전해줘.
en: please thank him for me.

source: 나 다친 거 다 나으면,
en: once I get better...

source: 진짜는 여기 있지롱~!
en: the real one is right here!

source: 미꾸라지 같은게…!
en: you mongrel...!

source: 흉측한 병균이 옮는다면서…
en: ...wouldn’t even come close to me...

source: 부적 부 (水) :
en: talisman *水:

source: 준비 다 됐습니다.
en: we’re ready.

source: 아악!
en: ouch!

source: 찾았다.
en: found you.

source: 무슨 일이야?!
en: what’s going on?!

source: 뭐라더라 그 요괴는 주로 어린 여자나 애들을 잡아먹는다며?
en: I heard that demons eat young girls and babies.

source: 내가 너무 늦게 깨어나는 바람에…
en: I guess I woke up too late...

source: 응?
en: hm?

source: 이곳에 있어봤자 더 괴롭기만 할테고…
en: staying here would just be painful.

source: 허상에 사로잡히지 마라, 선아!
en: don’t be fooled by illusions, sun-ah!

source: 뭐, 뭐야 이 헐벗은 놈은 또?!
en: wh-who’s this half-naked guy?!

source: 아뇨아뇨!
en: no, no!

source: 틀렸어.
en: this isn’t gonna work.

source: 넌 내게 손 하나 댈 수 없다.
en: you can’t touch me.

source: 형제들을 모두 되살리는 게 먼저라는 거지?
en: so, you’re saying that we need to first bring the rest of us back to life, right?

source: 또 같이 말놀이 해줄 거야?
en: ...will you play with me again?

source: 크헤헤헤헥!
en: gyahaha!

source: 큭…!
en: ugh!

source: 무슨 소리지?
en: what’s that sound?

source: 먹잇감이 어쩌고 미끼가 뭐가 어째?!
en: are you serious?!

source: 여기에 응할지 말지는 네 마음이지만…
en: it’s up to you whether I do what she’s asking me to do or not...

source: 저희 일족은 수많은 위험으로부터 목숨을 걸고 이 진경을 수호해왔습니다.
en: our family has been protecting the jinkyung with our lives.

source: 그러니까…
en: so...

source: 그… 그러고보니…
en: um... now that I think of it...

source: 우, 우선…
en: f-first...

source: 자리부터 피하고 보자!
en: let’s get out of here!

source: 남자들이 전부 개로 변했다며?!
en: ...all the men have turned into dogs, huh?!

source: 흥.
en: hmph.

source: 선아는 어떻게 지내냐고…
en: they wanted to know how you were doing.

source: 이런…!!
en: ugh...!

source: 제가 매일 가져오는 산나물이나 나무를 사주시잖아요.
en: you buy the wild greens and wood that I bring every day.

source: 항아는 내 힌트를 이해했을까?
en: did hang-ah get what I was trying to tell her?

source: 그러니까 네 위로 11명의 언니들이 있는데,
en: so you have 11 older sisters...

source: 그러고보니 이 녀석 하루종일 아무 것도 못 먹었을 텐데…
en: he probably hasn’t eaten anything all day...

source: 둘이 얘기하고 있는걸 보게 돼서 말야.
en: ...you two talking.

source: …내가
en: I...

source: ―저희의 고통을 헤아려 주십시오.
en: ...to empathize with our pain.

source: 네겐 위해주는 척 이렇게 말했겠지?
en: did she say something like this, pretending she cared about you?

source: 아깝게 기력만 낭비했잖아!
en: you’re just wasting my energy!

source: 어떻게 이렇게 자세히 알고 있게?
en: are you wondering how I know your story so well?

source: 여자 무당…
en: female shaman...

source: 신중해야지.
en: we have to be smart.

source: 불이~!!
en: fire!

source: 여척!!
en: yeochuk!

source: 완전 괜찮다니까!
en: look, I’m completely fine!

source: 우선은 한발 네가 바라는대로…
en: for now, just as you want me to,

source: 아, 정말 적응 안 되네 이거…
en: ah, I can’t believe this...

source: 어디선가 똑같이 느꼈는데…
en: I know I’ve felt like this somewhere before...

source: 촌장님!!
en: mayor!

source: 영업시간은 벌써 끝났는데 무슨 볼일이실까, 손님?
en: what could a guest possibly want from me after-hours?

source: 쿠아아아아아!!
en: aaargh!

source: 내가 저 자를 막을 터이니…
en: I’ll stop that demon...

source: 이게 뭐야?
en: what’s this?

source: 설마…!
en: it can’t be...!

source: 꺄아아아악!!
en: kyaaa!

source: 우릴 사냥하고 다니는 인간 놈이 있다더니… 설마 이 계집인가?
en: I heard there’s a human who’s hunting us down... is she the one?

source: 어제 뒷산에서 토막난 요괴사체가 발견되었대.
en: a demon was found torn into pieces on the mountain yesterday.

source: 우하하하, 넌 이제 끝장이다, 이 자식아!!
en: hahaha! you’re finished now, you bastard!

source: 아,
en: oh...

source: 아이가 이쪽으로 온 게 확실해?
en: are you sure the girl came this way?

source: 여척도 이 마을도 그것 때문에 습격을 받은 건가?
en: did yeochuk and the village get attacked because of it?

source: 하~ 이거 아무한테나 안 보여주는 건데…
en: I’ve never shown this to anyone, but...

source: 난 그저!
en: I-I just

source: 역시…
en: I knew it...

source: 아무것도…
en: it’s nothing...

source: 이제 끝이…
en: it’s all over--

source: 어미만 불쌍하게 됐지 뭐.
en: I feel bad for her mother.

source: 해가 지기 시작했어요.
en: the sun’s setting.

source: 움직이지 마!!
en: don’t move!

source: 물러서 있어.
en: stay back.

source: 차려입은 복식이 댁이랑은 다른 소속인 것 같단 말이지?
en: the way they’re dressed, they don’t seem like they’re from your village.

source: 헉… 헉… 선아야!
en: haa... haa... sun-ah!

source: 그래… 요것까지만 넣자.
en: and yeah... this as well.

source: 갑자기 그 못생긴 얼굴은 무엇이냐?
en: why does your face look uglier than normal?

source: 선아야―!
en: sun-ah!

source: 항아님은…
en: miss hang-ah...

source: 소소… 괜찮겠지?
en: sosoh... are you okay?

source: 이 사람들 엄청 강해!!
en: these people are extremely strong!

source: 여기 동방삭이란 자와 함께…
en: ...along with this man, dongbangsak...

source: 정체가 뭐냐, 넌?
en: who are you?

source: 무슨 일이야?
en: what happened?

source: 항아님!!
en: miss hang-ah!

source: 나도 얼른 사람으로 돌아가고 싶단말야, 멍!
en: I want to turn back into a human too, woof!

source: 뭐 간에 기별이나 간다고 이런 꼬맹일 잡아먹고 지랄이야!
en: he’s just a child, you beasts!

source: 대체 무슨 일이 있었던 거냐?
en: what happened?

source: 오래 안 걸린다며?
en: you said it wasn’t going to take long.

source: 도망치지 마라!!
en: don’t run away!

source: 우리 아들이 개가 됐어!!
en: my son has turned into a dog!

source: 나도 이름 정돈 들어본 적 있고.
en: and I’ve heard of your name before.

source: 어디서 튀어나온겨, 또!!
en: gah! this thing again?!!

source: 손 같은 소리하고 있네, 이 지지배야!!
en: what are you doing, asking for my paw?!

source: 나도 그때 같이…
en: but then...

source: 얼마나 길어질지 모르니…
en: we don’t know how long it’s going to be...

source: 호호.
en: ohoho.

source: 이렇게나 많이 모였단 말이지!
en: she was able to gather so many!

source: 어, 언니?!
en: h-huh?!

source: 과거와 미래를 읽어내며…
en: a divine mirror that can read the past and the future...

source: 위험해요!!
en: watch out!

source: 땅에서…
en: on the ground...

source: 내가 부적술만 쓸 수 있는 줄 아냐?
en: did you think that all I could do is use talismans?

source: 그러니 저주도 풀어주실 거죠?!
en: now you’re gonna break the curse, right?!

source: 뭐 결국 비밀이란 거네?
en: so you’re keeping it a secret?

source: 이야아~ 활 쏘는 무인이신가?
en: wow, are you an archer?

source: 네가 이길 수 없는 상대라고?
en: you can’t defeat it?

source: 그 진경이라는 것이 대체 무엇이지?
en: what exactly is this jinkyung?

source: 다시 한 번 요괴들이 넘치는 불지옥을 만들어,
en: I’m going to unleash a hell full of demons,

source: 기분 나쁜 애야.
en: she’s such a creepy kid.

source: 아끼던 아이들이었나 보군.
en: I guess you liked those kids.

source: 한발이잖아!
en: hanbal!

source: 견봉국 저주요?
en: the curse of the dog nation?

source: 꽤 오랫동안 이곳에 머물러 있다보니…
en: because it’s been a while since leaving home...

source: 아는데 왜 싸워?
en: then why would I fight?

source: 너 괜찮냐?
en: are you all right?

source: 무기를!!
en: ...to shoot down a bird!

source: 농담이에요!
en: I was just kidding!

source: 이런 쭈그렁 할망구가 희화라니…
en: this little old lady is the solar goddess...?

source: 까아아 아아악!!
en: kyaaaaaaaaahhh!

source: 아 그리고 거울 뒷면 좀 잠깐 봐줄래?
en: oh and could you please check the back of the mirror?

source: 설마 천하의 이 동방삭님이…
en: I, the great dongbangsak...

source: 아뇨 저…
en: no. I...

source: 어휴, 어머니!!
en: oh my, mother!

source: 저 노인네 얘기 들었지?
en: you heard the old man, right?

source: 혹시 저주와 관련된…?!
en: does this have something to do with the curse...?!

source: 전쟁이라니… 대체 뭘 할 셈이냐?
en: a war...? what are you thinking of doing?

source: 식량은 넉넉한 편이 좋아.
en: it’s good to have more than enough food.

source: 오빠!!
en: brother!!

source: 가… 가까이 오지 마!
en: d-don’t come any closer!

source: 지상으로 내려오게 하는 건 성공했다.
en: ...brought him down to the ground.

source: 네?
en: huh?

source: 밥먹을 땐 개도 안 건드린다는데!!
en: can’t you see I’m eating?!

source: 확인해봐야 할 것이라뇨?
en: what do you need to check out?

source: 맞다맞아!
en: yes, that’s right!

source: 그 위의 더 높은 곳엔…
en: up at a higher place is...

source: 소소!!
en: sosoh!

source: 말도 안돼!
en: impossible!

source: 내…
en: I...

source: 갖고 있는 그 출중한 능력을 이용해서…
en: ...should use your talents to...

source: 으아아아아아 멈추질 않아!!
en: aahhhh! I can’t stop!

source: 네놈들한테 나중이 있을 거 같아?
en: you think you’ll have a future?

source: 여기저기 짜증나는 놈들 투성이구만.
en: there are so many annoying pricks everywhere.

source: 휴여산(休與山)
en: mount huyeo

source: 제법이야?
en: that’s impressive!

source: 마음 가는대로 움직이는 게 인간이잖아.
en: people just feel what they feel.

source: 필시 말 못할 복잡한 사정이 있을 거라고.
en: I’m sure he has his reasons.

source: 나중에 꼭 찾으러 갈 테니까 어서 도망쳐!!
en: I’ll find you, so just run!
